// js/config.js
// 盒子配置数据
const BOXES = [
    {
        id: 'box31',
        name: '#31',
        themeColor: '#dd7b8b',   // 粉色
        items: [
            '酒神精一', '酒神精二', 'Miss.Christine精一', 'Miss.Christine精二',
            '蒂比精一', '蒂比精二', '司霆惊蛰精一', '司霆惊蛰精二',
            '录武官精一', '录武官精二', '四月精一', '四月精二', '梅精一', '梅精二'
        ]
    },
    {
        id: 'box49',
        name: '#49',
        themeColor: '#d6ecf0',   // 浅蓝
        items: [
            '假日威龙陈精一', '假日威龙陈精二', '水月精一', '水月精二',
            '龙舌兰精一', '龙舌兰精二', '羽毛笔精一', '羽毛笔精二',
            '蓝毒精一', '蓝毒精二','远山精一', '远山精二', '杰西卡精一', '杰西卡精二'
        ]
    },
    {
        id: 'box52',
        name: '#52',
        themeColor: '#ffc64b',   // 黄？
        items: [
            '望精一', '望精二', '赤刃明霄陈精一', '赤刃明霄陈精二',
            '缇缇精一', '缇缇精二', '摆渡人精一', '摆渡人精二',
            '矩精一', '矩精二', '风絮精一', '风絮精二', '撷英调香师精一', '撷英调香师精二'
        ]
    }
    // 新盒添加中
];